; $Header: /cag/LEGO/batch/partsmac/800/batttool.ini 1.9 2000-04-11 12:47:19-07 heich Exp $
;
; DESCRIPTION:
;        toolbar for table layouts

[GraphicalObject]
Name=tabtool
X=0
Y=0
Width=293
Height=37
FrameThickness=0
Activate=0
RC-DLL=LANGUAGE\HLBAT008.JPN

[ToolDescriptor]
1 = DispGroup,    GROUPFRAME,      hpgbut02.dll
2 = DispUnknown,  StickyButton,    hpgbut02.dll
3 = DispCalib,    StickyButton,    hpgbut02.dll
4 = DispControl,  StickyButton,    hpgbut02.dll

;#ModBySecPac#
8 = Integrate,    PUSHBUTTON,      hpgbut02.dll

5 = Grow,         PUSHBUTTON,      hpgbut02.dll
6 = Shrink,       PUSHBUTTON,      hpgbut02.dll
7 = TableLayout,  StickyButton,    hpgbut02.dll

[GroupFrame DispGroup]
x=0
y=0
width=2
height=40
FrameThickness=1

[StickyButton DispUnknown]
x=7
y=4
width=30
height=30
Help=バッチ テーブルのサンプル タイプが 'サンプル' の分析を表示/非表示します
ImageList=RBMP.SMPUNK1|RBMP.SMPUNK0|RBMP.SMPUNK1|RBMP.SMPUNK0
CmdList=BatchShowSampleType 1, "Sample", 0 | BatchShowSampleType 1, "Sample", 1
FrameThickness=2

[StickyButton DispCalib]
x=37
y=4
width=30
height=30
Help=バッチ テーブルのサンプル タイプが 'キャリブレーション' の分析を表示/非表示します
ImageList=RBMP.SMPCAL1|RBMP.SMPCAL0|RBMP.SMPCAL1|RBMP.SMPCAL0
CmdList=BatchShowSampleType 3, "Calib", 0 | BatchShowSampleType 3, "Calib", 1
FrameThickness=2

[StickyButton DispControl]
x=67
y=4
width=30
height=30
Help=バッチ テーブルのサンプル タイプが 'コントロール' の分析を表示/非表示します
ImageList=RBMP.SMPCTRL1|RBMP.SMPCTRL0|RBMP.SMPCTRL1|RBMP.SMPCTRL0
CmdList=BatchShowSampleType 4, "Control", 0 |BatchShowSampleType 4, "Control", 1
FrameThickness=2

;#ModBySecPac#

[PUSHBUTTON Integrate]
x=97
y=4
width=30
height=30
Help="マニュアル積分等によるメソッド変更を表示するために積分結果をアップデートします。"
ImageList=RBMP.SECINTEG|RBMP.SECINTEG|RBMP.SECINTGD
Command=sec_CompareIntResults
FrameThickness=2

[PUSHBUTTON Grow]
x=226
y=4
width=30
height=15
Help=一般サンプル情報テーブル表示に行を追加します
ImageList=RBMP.Grow|RBMP.grow|RBMP.Grow
Command=CPBatch.BatchShowToolBar 1, 0, TabHdrVal(_config[1],"BatchOptions","TableHeight")+16
FrameThickness=2

[PUSHBUTTON Shrink]
x=226
y=19
width=30
height=15
Help=一般サンプル情報テーブル表示の行を削除します
ImageList=RBMP.Shrink|RBMP.shrink|RBMP.Shrink
Command=CPBatch.BatchShowToolBar 1, 0, TabHdrVal(_config[1],"BatchOptions","TableHeight")-16
FrameThickness=2

[StickyButton TableLayout]
x=263
y=4
width=30
height=30
Help=化合物テーブルを表示/消去します
ImageList=RBMP.Lay2Tab|RBMP.Lay2Tab0|RBMP.Lay2Tab|RBMP.Lay2Tab0
CmdList=CPBatch.BatchShowToolBar 1, 1| CPBatch.BatchShowToolBar 1, 2
FrameThickness=2
;				!=1 --> batch Table with list of compounds
;				!=2 --> batch Table and table of compounds
